{
  "backend/main.mo": "Main Motoko actor implementing a personal productivity app with user profiles, studies, work items, habits, and goals, using access control and persistent storage with Map and Set data structures.",
  "feature_evidence.json": "Feature evidence report documenting the addition of 'Made by Akshita Tiwari' credit text in the Layout component footer with high confidence.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend TypeScript/React files including components, pages, hooks, and configuration files for the MOMENTUM productivity app.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining design tokens for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point for the MOMENTUM app with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for landing, dashboard, studies, work, habits, and goals pages, plus authentication and profile setup logic.",
  "frontend/src/components/DashboardCard.tsx": "Reusable card component for dashboard displaying section title, item count, icon with gradient background, and navigation link with hover effects.",
  "frontend/src/components/GoalCard.tsx": "Card component displaying goal details including title, description, target date, progress bar, milestones checklist, and completion status badge.",
  "frontend/src/components/GoalForm.tsx": "Dialog form for creating goals with title, description, target date picker, and dynamic milestones array with add/remove functionality.",
  "frontend/src/components/HabitCard.tsx": "Card component displaying habit with name, description, weekly frequency target, 7-day tracking checkboxes, completion count, and streak badge with flame icon.",
  "frontend/src/components/HabitForm.tsx": "Dialog form component for creating new habits with fields for name, description, and weekly frequency target (1-7 times). Uses React Hook Form pattern and mutation hook for submission.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header navigation, authenticated route links (Dashboard, Studies, Work, Habits, Goals), and footer with branding and caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity, with loading states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup that prompts for name input and cannot be dismissed until completed.",
  "frontend/src/components/StudyCard.tsx": "Card component displaying study subject details including name, description, progress percentage with visual progress bar, and study schedule.",
  "frontend/src/components/StudyForm.tsx": "Dialog form for adding new study subjects with fields for subject name, description, study schedule, and initial progress slider (0-100%).",
  "frontend/src/components/WorkCard.tsx": "Card component for work items showing project name, description, deadline with calendar icon, completion status, and dynamic badges for overdue/upcoming deadlines.",
  "frontend/src/components/WorkForm.tsx": "Dialog form for creating work items with project name, description, and deadline date picker that enforces minimum date of today.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current user's profile from the backend actor.",
  "frontend/src/hooks/useGoals.ts": "Provides hooks for fetching goals list and adding new goals with automatic cache invalidation.",
  "frontend/src/hooks/useHabits.ts": "Provides hooks for fetching habits list and adding new habits with automatic cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook for saving the current user's profile and invalidating the profile cache.",
  "frontend/src/hooks/useStudies.ts": "Provides hooks for fetching studies list and adding new studies with automatic cache invalidation.",
  "frontend/src/hooks/useWorkItems.ts": "Provides hooks for fetching work items (sorted by deadline) and adding new work items with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using warm coral, amber, and teal color palette with OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrapper around the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying overview cards for studies, work items, habits, and goals with loading states and quick tips section.",
  "frontend/src/pages/Goals.tsx": "Goals management page with tabbed view for active and completed goals, add goal button, and empty state handling.",
  "frontend/src/pages/Habits.tsx": "Habits page component that displays a grid of habit cards, handles loading states, shows an empty state with call-to-action, and provides a button to open the HabitForm modal for adding new habits.",
  "frontend/src/pages/Landing.tsx": "Landing page component that displays hero section, feature grid showcasing Studies/Work/Habits/Goals modules, and a call-to-action button for Internet Identity login; redirects authenticated users to dashboard.",
  "frontend/src/pages/Studies.tsx": "Studies page component that displays a grid of study subject cards, handles loading states, shows an empty state with call-to-action, and provides a button to open the StudyForm modal for adding new studies.",
  "frontend/src/pages/Work.tsx": "Work page component that displays work items in a tabbed interface (Active/Completed), shows counts for each tab, handles loading and empty states, and provides a button to open the WorkForm modal for adding new work items.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space (coral, amber, teal), container settings, border radius variables, Inter font family, and animation keyframes for accordion components.",
  "project_state.json": "Project state file tracking a life management web platform called MOMENTUM for young people, with features for studies, work, habits, goals, and Internet Identity authentication. Contains architectural notes, existing features, requirements, and file structure metadata."
}