{
  "backend/main.mo": "Main Motoko actor implementing a life planning app with user profiles, studies, work items, habits, and goals, using access control and persistent storage with Map and Set data structures.",
  "feature_evidence.json": "Feature evidence report documenting three completed rebranding tasks that changed 'Life Planner' to 'MOMENTUM' in index.html, Layout.tsx, and Landing.tsx.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend TypeScript/React files describing components, pages, hooks, and configuration for the MOMENTUM life planning application.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space with neutral grayscale and accent colors.",
  "frontend/index.html": "HTML entry point with page title 'MOMENTUM' and root div for React application mounting.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for landing, dashboard, studies, work, habits, and goals pages, plus authentication and profile setup logic.",
  "frontend/src/components/DashboardCard.tsx": "Reusable card component displaying a section title, item count, icon with gradient background, and navigation link with hover effects.",
  "frontend/src/components/GoalCard.tsx": "Card component rendering a goal with title, description, target date, progress bar, milestone checkboxes, and completion badge.",
  "frontend/src/components/GoalForm.tsx": "Dialog form for creating goals with title, description, target date picker, and dynamic milestone input fields with add/remove functionality.",
  "frontend/src/components/HabitCard.tsx": "Displays a habit card with name, description, weekly target, completion checkboxes for each day, and a streak badge with flame icon. Calculates and shows current streak from tracking history.",
  "frontend/src/components/HabitForm.tsx": "Dialog form for creating new habits with fields for name, description, and frequency target (1-7 times per week using a slider). Submits to useAddHabit hook with loading state.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header containing logo, navigation links (Dashboard, Studies, Work, Habits, Goals), login button, and footer with branding and caffeine.ai attribution. Navigation only visible when authenticated.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login/logout states using Internet Identity, with loading spinner during authentication and query cache clearing on logout.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup that prompts for name input and saves via useSaveCallerUserProfile hook. Cannot be dismissed until completed.",
  "frontend/src/components/StudyCard.tsx": "Displays a study subject card with name, description, progress percentage badge, progress bar, and study schedule. Shows hover shadow effect.",
  "frontend/src/components/StudyForm.tsx": "Dialog form for adding new study subjects with fields for subject name, description, study schedule, and progress slider (0-100%). Submits to useAddStudy hook.",
  "frontend/src/components/WorkCard.tsx": "Displays work item card with project name, description, deadline, completion status icon, and dynamic badges showing overdue/days remaining status. Applies opacity when completed.",
  "frontend/src/components/WorkForm.tsx": "A dialog form component for adding new work items with fields for project name, description, and deadline. Uses React Hook Form state and the useAddWorkItem mutation hook to submit data.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor. Returns loading states and profile data.",
  "frontend/src/hooks/useGoals.ts": "Provides useGoals query hook to fetch goals list and useAddGoal mutation hook to add new goals. Both interact with the backend actor and manage cache invalidation.",
  "frontend/src/hooks/useHabits.ts": "Provides useHabits query hook to fetch habits list and useAddHabit mutation hook to add new habits. Both interact with the backend actor and manage cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides authentication status and identity to child components.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook that saves the current user's profile to the backend and invalidates the user profile cache on success.",
  "frontend/src/hooks/useStudies.ts": "Provides useStudies query hook to fetch studies list and useAddStudy mutation hook to add new studies. Both interact with the backend actor and manage cache invalidation.",
  "frontend/src/hooks/useWorkItems.ts": "Provides useWorkItems query hook to fetch and sort work items by deadline, and useAddWorkItem mutation hook to add new work items. Both interact with the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a warm coral/amber/teal color palette in OKLCH color space, supporting both light and dark themes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying overview cards for studies, work items, habits, and goals with counts and navigation links. Redirects to home if user is not authenticated.",
  "frontend/src/pages/Goals.tsx": "Goals page component that displays active and completed goals in tabs, with authentication check, loading states, and a form to add new goals.",
  "frontend/src/pages/Habits.tsx": "Habits page component that displays habit cards with authentication check, loading states, and a form to add new habits.",
  "frontend/src/pages/Landing.tsx": "Landing page component with hero section, feature grid showcasing Studies/Work/Habits/Goals modules, and Internet Identity login button that redirects authenticated users to dashboard.",
  "frontend/src/pages/Studies.tsx": "Studies page component that displays study subject cards with authentication check, loading states, and a form to add new study subjects.",
  "frontend/src/pages/Work.tsx": "Work page component that displays active and completed work items in tabs, with authentication check, loading states, and a form to add new work items.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color palette using OKLCH color space, extended theme with custom fonts (Inter), border radius variables, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a life management web platform called 'MOMENTUM' for young people, tracking 14 implemented features including dashboard, studies/work/habits/goals management, Internet Identity authentication, and visual theming with warm colors."
}